#include <iostream>
#include "circle.h"

using namespace std;

int main() {
    system("chcp 65001");
    float r1, x1, y1;
    cout << "введите радиус и координаты для окружности 1: ";
    cin >> r1 >> x1 >> y1;
    circle c1(r1, x1, y1);

    float r2, x2, y2;
    cout << "введите радиус и координаты для окружности 2: ";
    cin >> r2 >> x2 >> y2;
    circle c2(r2, x2, y2);

    float r3, x3, y3;
    cout << "введите радиус и координаты для окружности 3: ";
    cin >> r3 >> x3 >> y3;
    circle c3(r3, x3, y3);

    cout << "площадь окружности 1: " << c1.square() << endl;
    cout << "площадь окружности 2: " << c2.square() << endl;
    cout << "площадь окружности 3: " << c3.square() << endl;

    cout << "можно ли окружность 1 описать вокруг треугольника со сторонами(3 4 5): " << c1.triangle_around(3, 4, 5)<< endl;
    cout << "можно ли треугольник сторонами(3 4 5) описать вокруг окружности 1: " << c1.triangle_in(3, 4, 5) << endl;

    cout << "можно ли окружность 2 описать вокруг треугольника сторонами(3 4 5): " << c2.triangle_around(3, 4, 5)<< endl;
    cout << "можно ли треугольник сторонами(3 4 5) описать вокруг окружности 2: " << c2.triangle_in(3, 4, 5) << endl;

    cout << "можно ли окружность 3 описать вокруг треугольника сторонами(3 4 5): " << c3.triangle_around(3, 4, 5)<< endl;
    cout << "можно ли треугольник сторонами(3 4 5) описать вокруг окружности 3: " << c3.triangle_in(3, 4, 5) << endl;

    float r4, x4, y4;
    for (int i = 1; i < 4; i++) {
        cout << "введите радиус и координаты для новой окружности, чтобы проверить, пересекается ли она с окружностью " << i << ": ";
        cin >> r4 >> x4 >> y4;
        if (c1.check_circle(r4, x4, y4)) {
            cout << "Новая окружность пересекается с окружностью"<< i << endl;
        }
        else
        {
            cout << "Новая окружность не пересекается с окружностью "<< i << endl;
        }
    }
}